---
kind: property
id: P:Autodesk.Revit.DB.FamilyElementVisibility.IsShownInFrontBack
source: html/f8fbfcda-0b4f-8b51-f955-9f51c1a6374f.htm
---
# Autodesk.Revit.DB.FamilyElementVisibility.IsShownInFrontBack Property

Indicates if the instance is display in Front/Back view of project document.

## Syntax (C#)
```csharp
public bool IsShownInFrontBack { get; set; }
```

## Remarks
This property matters for objects whose visibility type is Model.